tap "homebrew/bundle"
tap "homebrew/core"

brew "gh"
brew "diff-so-fancy"
brew "node"
brew "git-delta"
brew "zplug"
brew "starship"
brew "exa"
brew "neovim"
brew "dockutil"
brew "wget"
brew "bpytop"
brew "fzf"
brew "shellcheck"
brew "the_silver_searcher"
brew "fd"
brew "ripgrep"
brew "bat"
